{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "metadata_in_weights" : [

  ],
  "layers" : [
    {
      "size_of_axes" : 1,
      "bottom" : "h_in",
      "axes_0" : 0,
      "weights" : {

      },
      "nd_axis" : 0,
      "debug_info" : "15_batch_first_lstm_h0_squeeze",
      "version" : 1,
      "top" : "15_batch_first_lstm_h0_squeeze",
      "type" : "squeeze",
      "name" : "15_batch_first_lstm_h0_squeeze"
    },
    {
      "size_of_axes" : 1,
      "bottom" : "c_in",
      "axes_0" : 0,
      "weights" : {

      },
      "nd_axis" : 0,
      "debug_info" : "15_batch_first_lstm_c0_squeeze",
      "version" : 1,
      "top" : "15_batch_first_lstm_c0_squeeze",
      "type" : "squeeze",
      "name" : "15_batch_first_lstm_c0_squeeze"
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "encoder_features",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "transpose_1",
      "top" : "transpose_1",
      "type" : "transpose",
      "name" : "transpose_1"
    },
    {
      "size_of_axes" : 2,
      "bottom" : "transpose_1",
      "axes_0" : 3,
      "axes_1" : 4,
      "weights" : {

      },
      "nd_axis" : 0,
      "debug_info" : "transpose_1_expanded",
      "top" : "transpose_1_expanded",
      "type" : "expand_dims",
      "name" : "transpose_1_expanded"
    },
    {
      "size_of_axes" : 3,
      "bottom" : "15_batch_first_lstm_h0_squeeze",
      "axes_0" : 0,
      "axes_1" : 3,
      "axes_2" : 4,
      "nd_axis" : 0,
      "weights" : {

      },
      "debug_info" : "15_batch_first_lstm_h0_squeeze_expanded",
      "top" : "15_batch_first_lstm_h0_squeeze_expanded",
      "type" : "expand_dims",
      "name" : "15_batch_first_lstm_h0_squeeze_expanded"
    },
    {
      "size_of_axes" : 3,
      "bottom" : "15_batch_first_lstm_c0_squeeze",
      "axes_0" : 0,
      "axes_1" : 3,
      "axes_2" : 4,
      "nd_axis" : 0,
      "weights" : {

      },
      "debug_info" : "15_batch_first_lstm_c0_squeeze_expanded2",
      "top" : "15_batch_first_lstm_c0_squeeze_expanded2",
      "type" : "expand_dims",
      "name" : "15_batch_first_lstm_c0_squeeze_expanded2"
    },
    {
      "input_size" : 128,
      "arch" : 1,
      "quantization_scale_h" : 1,
      "quantization_scale_x" : 1,
      "hidden_size" : 128,
      "nonlinearity_alpha" : 1,
      "nonlinearity_bidir_type" : 0,
      "lstm_forget_bias" : 0,
      "coupled_input_forget" : 0,
      "quantization_simple_mode" : false,
      "bias_vector_flag" : 1,
      "mode" : 0,
      "cell_clip_threshold" : 500,
      "type" : "rnn_arch",
      "internal_nonlinearity_second_beta" : 1,
      "internal_nonlinearity_alpha" : 1,
      "internal_nonlinearity_beta" : 1,
      "forget_bias" : 0,
      "weights" : {
        "W_h" : 1,
        "W_x" : 3,
        "b" : 5
      },
      "lstm_has_peepholes" : 0,
      "beta" : 1,
      "quantization_mode" : 0,
      "name" : "15_batch_first",
      "quantization_scale_h_reverse" : 0,
      "top" : "15_batch_first_0_5d,15_batch_first_1_5d,15_batch_first_2_5d",
      "input_bias" : false,
      "alpha" : 1,
      "quantization_scale_x_reverse" : 0,
      "max_batch_size" : 1,
      "reset_after" : false,
      "debug_info" : "15_batch_first",
      "hidden_bias" : false,
      "nonlinearity_bidir_alpha" : 1,
      "nonlinearity_beta" : 1,
      "internal_nonlinearity_second_alpha" : 1,
      "encoder_bidirectional_mode" : 0,
      "internal_nonlinearity_type" : 2,
      "bottom" : "transpose_1_expanded,15_batch_first_lstm_h0_squeeze_expanded,15_batch_first_lstm_c0_squeeze_expanded2",
      "nonlinearity_type" : 0,
      "nonlinearity_bidir_beta" : 1,
      "encoder_output_sequence" : 1,
      "internal_nonlinearity_second_type" : 0
    },
    {
      "size_of_axes" : 2,
      "bottom" : "15_batch_first_0_5d",
      "axes_0" : 3,
      "axes_1" : 4,
      "weights" : {

      },
      "nd_axis" : 0,
      "debug_info" : "15_batch_first_0",
      "version" : 1,
      "top" : "15_batch_first_0",
      "type" : "squeeze",
      "name" : "15_batch_first_0"
    },
    {
      "name" : "15_batch_first_1",
      "version" : 1,
      "axes_2" : 4,
      "axes_1" : 3,
      "type" : "squeeze",
      "axes_0" : 0,
      "nd_axis" : 0,
      "bottom" : "15_batch_first_1_5d",
      "debug_info" : "15_batch_first_1",
      "size_of_axes" : 3,
      "weights" : {

      },
      "top" : "15_batch_first_1"
    },
    {
      "name" : "15_batch_first_2",
      "version" : 1,
      "axes_2" : 4,
      "axes_1" : 3,
      "type" : "squeeze",
      "axes_0" : 0,
      "nd_axis" : 0,
      "bottom" : "15_batch_first_2_5d",
      "debug_info" : "15_batch_first_2",
      "size_of_axes" : 3,
      "weights" : {

      },
      "top" : "15_batch_first_2"
    },
    {
      "bottom" : "15_batch_first_1",
      "size_of_axes" : 1,
      "axes_0" : 0,
      "weights" : {

      },
      "nd_axis" : 0,
      "debug_info" : "16",
      "top" : "h_out",
      "type" : "expand_dims",
      "name" : "16",
      "attributes" : {
        "is_output" : 1
      }
    },
    {
      "bottom" : "15_batch_first_2",
      "size_of_axes" : 1,
      "axes_0" : 0,
      "weights" : {

      },
      "nd_axis" : 0,
      "debug_info" : "17",
      "top" : "c_out",
      "type" : "expand_dims",
      "name" : "17",
      "attributes" : {
        "is_output" : 1
      }
    },
    {
      "axis_seq" : 4,
      "name" : "transpose_0",
      "axis_n" : 3,
      "axis_h" : 2,
      "type" : "transpose",
      "attributes" : {
        "is_output" : 1
      },
      "bottom" : "15_batch_first_0",
      "axis_w" : 0,
      "axis_k" : 1,
      "debug_info" : "transpose_0",
      "weights" : {

      },
      "top" : "rnn_out"
    }
  ]
}